Repository: arthurdejong/nss-pam-ldapd
Catalog: po/*.po
Languages: fi, sv

source: LDAP administrator password:
fi: LDAP-ylläpitäjän salasana:
sv: LDAP-administratörslösenord:

source: (current) LDAP Password:
fi: (nykyinen) LDAP-salasana:
sv: (nuvarande) LDAP-lösenord:

source: Password will expire in %u days
fi: Salasana vanhentuu %u päivän päästä
sv: Lösenordet kommer att löpa ut om %u dagar

source: Password will expire in %u hours
fi: Salasana vanhentuu %u tunnin päästä
sv: Lösenordet kommer att löpa ut om %u timmar

source: Password will expire in %u hours and %u minutes
fi: Salasana vanhentuu %u tunnin ja %u minuuttin päästä
sv: Lösenordet kommer att löpa ut om %u timmar och %u minuter

source: Password will expire in %u minutes
fi: Salasana vanhentuu %u minuutin päästä
sv: Lösenordet kommer att löpa ut om %u minuter

source: Password will expire in %u minutes and %u seconds
fi: Salasana vanhentuu %u minuutin ja %u sekunnin päästä
sv: Lösenordet kommer att löpa ut om %u minuter och %u sekunder

source: Password will expire in %u seconds
fi: Salasana vanhentuu %u sekunnin päästä
sv: Lösenordet kommer att löpa ut om %u sekunder

source: Password expired, %d grace logins left
fi: Salasana vanhentunut, %d kirjautumista jäljellä
sv: Lösenordet har löpt ut, %d loggningar kvar

source: Password expired
fi: Salasana vanhentunut
sv: Lösenordet har löpt ut

source: Account locked
fi: Käyttäjätili lukittu
sv: Kontot är låst

source: Change after reset
fi: Salasana on vaihdettava nollauksen jälkeen
sv: Lösenordet måste ändras efter återställning

source: Password modification not allowed
fi: Salasanan muuttaminen ei ole sallittua
sv: Lösenordsändring är inte tillåten

source: Must supply old password
fi: Anna vanha salasana
sv: Måste ange gammalt lösenord

source: Insufficient password quality
fi: Riittämätön salasanan laatu
sv: Otillräcklig lösenordskvalitet

source: Password too short
fi: Salasana on liian lyhyt
sv: Lösenordet är för kort

source: Password too young
fi: Salasana on vaihdettu liian äskettäin
sv: Lösenordet har ändrats för nyligen

source: Password in history
fi: Uusi salasana on vanhojen salasanojen luettelossa
sv: Nytt lösenord finns i listan över gamla lösenord

source: No error
fi: Ei virhettä
sv: Inget fel

source: Unknown error
fi: Tuntematon virhe
sv: Okänt fel

source: New Password:
fi: Uusi salasana:
sv: Nytt lösenord:

source: Retype %s
fi: Kirjoita uudelleen %s
sv: Ange %s igen

source: Password:
fi: Salasana:
sv: Lösenord:
