Repository: arthurdejong/nss-pam-ldapd
Catalog: debian/po/*.po
Languages: pt_br

source: LDAP server URI:
pt_br: URI do servidor LDAP:

source: Please enter the Uniform Resource Identifier of the LDAP server. The format is "ldap://<hostname_or_IP_address>:<port>/". Alternatively, "ldaps://" or "ldapi://" can be used. The port number is optional.
pt_br: Por favor entre com o Identicador Uniforme do Recurso (URI) do servidor LDAP. O formato é "ldap://<hostname_or_IP_address>:<port>/". Alternativamente, "ldaps://" ou "ldapi://" pode ser usado. O número da porta é opcional.

source: When using an ldap or ldaps scheme it is recommended to use an IP address to avoid failures when domain name services are unavailable.
pt_br: Quando usando métodos ldap ou ldaps é recomendado o uso de um endereço IP para evitar falhas quando os serviços de nome de domínio estão indisponí­veis.

source: Multiple URIs can be specified by separating them with spaces.
pt_br: Múltiplas URIs podem ser especifícadas separando-as com espaços.

source: LDAP server search base:
pt_br: Base de buscas do servidor LDAP:

source: Please enter the distinguished name of the LDAP search base. Many sites use the components of their domain names for this purpose. For example, the domain "example.net" would use "dc=example,dc=net" as the distinguished name of the search base.
pt_br: Por favor informe o nome distinto da base de procura LDAP. Muitos sites usam componentes de seus nomes de domí­nio para este propósito. Por exemplo, o domínio "example.net" usaria "dc=example,dc=net" como o nome distinto da base de procura.

source: none
pt_br: nenhum

source: simple
pt_br: simples

source: LDAP authentication to use:
pt_br: Autenticação LDAP a ser usada:

source: Please choose what type of authentication the LDAP database should require (if any):
pt_br: Por favor escolha qual o tipo de autenticação a base de dados LDAP deve requerir (se alguma):

source: * none: no authentication; * simple: simple bind DN and password authentication; * SASL: any Simple Authentication and Security Layer mechanism.
pt_br: * none: sem autenticação; * simple: DN vínculo simples e autenticação por senha; * SASL: qualquer Autenticação Simples e um mecanismo de Camada de Segurança

source: LDAP database user:
pt_br: Base de dados de usuários LDAP:

source: Enter the name of the account that will be used to log in to the LDAP database. This value should be specified as a DN (distinguished name).
pt_br: Informe o nome da conta que será usada para se autenticar na base de dados LDAP. Este valor deverá ser especificado como um ND (nome distinto)

source: LDAP user password:
pt_br: Senha do usuário LDAP:

source: Enter the password that will be used to log in to the LDAP database.
pt_br: Informe a senha que será usada para a autenticação na base de dados LDAP.

source: SASL mechanism to use:
pt_br: Mecanismo SASL para utilizar:

source: Choose the SASL mechanism that will be used to authenticate to the LDAP database:
pt_br: Escolha o mecanismo SASL que deverá ser utilizado para autenticar na base de dados LDAP.

source: * auto: auto-negotiation; * LOGIN: deprecated in favor of PLAIN; * PLAIN: simple cleartext password mechanism; * NTLM: NT LAN Manager authentication mechanism; * CRAM-MD5: challenge-response scheme based on HMAC-MD5; * DIGEST-MD5: HTTP Digest compatible challenge-response scheme; * GSSAPI: used for Kerberos; * OTP: a One Time Password mechanism.
pt_br: * auto: negociação automática; * LOGIN: depreciada em favor de PLAIN; * PLAIN: mecanismo simples de senha em texto puro * NTLM: mecanismo de autenticação NT LAN Manager; * CRAM-MD5: método desafio-resposta baseado em HMAC-MD5; * DIGEST-MD5: método compatí­vel desafio-resposta HTTP Digest; * GSSAPI: utilizado pelo Kerberos; * OTP: um mecanismo de senha de apenas uma vez.

source: SASL realm:
pt_br: Domí­nio SASL:

source: Enter the SASL realm that will be used to authenticate to the LDAP database.
pt_br: Entre com o domínio SASL que será utilizado para autenticação na base de dados LDAP.

source: The realm is appended to authentication and authorization identities.
pt_br: O domí­nio é anexado a autenticação e as identidades de autorização.

source: For GSSAPI this can be left blank to use information from the Kerberos credential cache.
pt_br: Para o GSSAPI isto pode ser deixado em branco para utilizar a informação do cache de credenciais Kerberos.

source: SASL authentication identity:
pt_br: Identidade de autenticação SASL:

source: Enter the SASL authentication identity that will be used to authenticate to the LDAP database.
pt_br: Entre com a identidade de autenticação SASL que será utilizada para autenticar na base de dados LDAP.

source: This is the login used in LOGIN, PLAIN, CRAM-MD5, and DIGEST-MD5 mechanisms.
pt_br: Este é o login usado nos mecanismos LOGIN, PLAIN, CRAM-MD5, e DIGEST-MD5.

source: SASL proxy authorization identity:
pt_br: Identidade do proxy de autorização SASL:

source: Enter the proxy authorization identity that will be used to authenticate to the LDAP database.
pt_br: Entre com a identidade de autorização do proxy que será utilizada para autenticar na base de dados LDAP.

source: This is the object in the name of which the LDAP request is done. This value should be specified as a DN (distinguished name).
pt_br: Este é o nome do objeto o qual a requisição LDAP é feita. Este valor deveria ser especificado como um ND (nome distinto).

source: Cyrus SASL security properties:
pt_br: Propriedades de segurança Cyrus SASL:

source: Enter the Cyrus SASL security properties. Allowed values are described in the ldap.conf(5) manual page in the SASL OPTIONS section.
pt_br: Entre com as propriedades de segurança Cyrus SASL. Valores permitidos estão descritos na página de manual ldap.conf(5) na seção SASL OPTIONS.

source: Kerberos credential cache file path:
pt_br: Caminho do arquivo de cache de credenciais Kerberos:

source: Enter the GSSAPI/Kerberos credential cache file name that will be used.
pt_br: Entre com o nome do arquivo de cache GSSAPI/Kerberos que será utilizado.

source: Use StartTLS?
pt_br: Usar StartTLS?

source: Please choose whether the connection to the LDAP server should use StartTLS to encrypt the connection.
pt_br: Por favor escolha se a conexão com o servidor LDAP deve usar StartTLS para criptografar a mesma.

source: never
pt_br: nunca

source: allow
pt_br: permitir

source: try
pt_br: tentar

source: demand
pt_br: demanda

source: Check server's SSL certificate:
pt_br: Verificar o certificado SSL do servidor:

source: When an encrypted connection is used, a server certificate can be requested and checked. Please choose whether lookups should be configured to require a certificate, and whether certificates should be checked for validity:
pt_br: Quando uma conexão criptografada é utilizada, um servidor certificado pode ser requerido e verificado. Por favor escolha se as pesquisas devem ser configuradas para requerir um certificado, e se o certificado deve ter a validade verificada.

source: * never: no certificate will be requested or checked; * allow: a certificate will be requested, but it is not required or checked; * try: a certificate will be requested and checked, but if no certificate is provided it is ignored; * demand: a certificate will be requested, required, and checked.
pt_br: * never: nenhum certificado será requisitado ou verificado; * allow: um certificado será requisitado, mas não é requerido ou verificado; * try: um certificado será requisitado e verificado, mas se nenhum certificado é provido o mesmo é ignorado; * demand: um certificado será requisitado, requerido, e validado.

source: If certificate checking is enabled, at least one of the tls_cacertdir or tls_cacertfile options must be put in /etc/nslcd.conf.
pt_br: Se a verificação do certificado está ativa, pelo menos uma das opções tls_cacertdir ou tls_cacertfile deve ser inclusa no /etc/nslcd.conf.

source: Name services to configure:
pt_br: Serviços de nome para configurar:

source: For this package to work, you need to modify your /etc/nsswitch.conf to use the ldap datasource.
pt_br: Para que este pacote funcione, você precisa modificar seu /etc/nsswitch.conf para utilizar a fonte de dados ldap.

source: You can select the services that should have LDAP lookups enabled. The new LDAP lookups will be added as the last datasource. Be sure to review these changes.
pt_br: Você pode selecionar os serviços que deveriam ter pesquisas LDAP ativadas. As novas pesquisas LDAP serão adicionadas como última fonte de dados. Tenha certeza de rever essas mudanças.

source: Remove LDAP from nsswitch.conf now?
pt_br: Remover agora o LDAP do nsswitch.conf?

source: The following services are still configured to use LDAP for lookups: ${services} but the libnss-ldapd package is about to be removed.
pt_br: Os serviços a seguir continuam configuradas para utilizar o LDAP para pesquisas: ${services} mas o pacote libnss-ldapd está prestes a ser removido.

source: You are advised to remove the entries if you don't plan on using LDAP for name resolution any more. Not removing ldap from nsswitch.conf should, for most services, not cause problems, but host name resolution could be affected in subtle ways.
pt_br: Você está avisado para remover as entradas se não planeja continuar utilizando o LDAP para resolução de nomes. Não remover o ldap do nsswitch.conf deve, para a maioria dos serviços, não causar problemas, mas a resolução de nome do host deverá ser afetada de maneiras misteriosas.

source: You can edit /etc/nsswitch.conf by hand or choose to remove the entries automatically now. Be sure to review the changes to /etc/nsswitch.conf if you choose to remove the entries now.
pt_br: Você pode editar /etc/nsswitch.conf manualmente ou escolher remover as entradas automaticamente agora. Tenha certeza de rever as mudanças no /etc/nsswitch.conf se escolher remover as entradas agora.

source: Enable shadow lookups through NSS?
pt_br: Ativar pesquisas obscuras através do NSS?

source: To allow LDAP users to log in, the NSS module needs to be enabled to perform shadow password lookups. The shadow entries themselves may be empty - that is, there is no need for password hashes to be exposed. See http://bugs.debian.org/583492 for background.
pt_br: Para permitir os usuários LDAP conectarrem-se, o módulo NSS deve estar ativado para fazer as pesquisas de senhas obscuras. As entradas obscuras podem estar vazias - isto é, nã há necessidade de hashes de senhas serem expostos. Veja http://bugs.debian.org/583492 para mais informações.

source: Please choose whether /etc/nsswitch.conf should have the required entry added automatically (in which case it should be reviewed afterwards) or whether it should be left for an administrator to edit manually.
pt_br: Por favor escolha se /etc/nsswitch.conf deve ter a entrada de valor acrescentado automaticamente (caso ao qual deve ser revisto mais tarde) ou se deve ser deixado para um administrador para editar manualmente.
